---
type: AddInIdAttribute
namespace: Autodesk.Revit.DB.Macros
version: 2024
members: 2
tags: [revit-api, class]
---

# AddInIdAttribute

`Autodesk.Revit.DB.Macros.AddInIdAttribute` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AddInIdAttribute | 2011 | `public AddInIdAttribute ( string addInIdStr )` |
| Property | Value | 2011 | `public ValueType Value { get ; }` |